from_1_to_9 = ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
from_11_to_19 = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
from_20_to_90 = [" ", " ", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]

number = input("Введите число от 0 до 99: ")

if number.isnumeric():
    number = int(number)
    if   0 <= number <= 9:
        print(from_1_to_9[number])
    elif 10 <= number <= 19:
        print(from_11_to_19[number%10])
    elif 20 <= number <= 99:
        if number%10 == 0:
            print(from_20_to_90[number//10])
        else:
            print(from_20_to_90[number//10], from_1_to_9[number%10])
else:
    print("Вы должны ввести число в диапозоне от 0 до 99!!!")